app/controllers/uploads_controller.rb

  def overview
    render "overview",
    locals: {
      purchasers: Purchaser.all,
      items: Item.all,
      purchases: Purchase.all,
      merchants: Merchant.all,
      sales: Sale.all
---
SELECT  `items`.* FROM `items`  ORDER BY `items`.`id` ASC LIMIT 1
SELECT  `merchants`.* FROM `merchants`  ORDER BY `merchants`.`id` ASC LIMIT 1
SELECT  `purchasers`.* FROM `purchasers`  ORDER BY `purchasers`.`id` ASC LIMIT 1
SELECT  `purchases`.* FROM `purchases`  ORDER BY `purchases`.`id` ASC LIMIT 1