app/views/uploads/index.html.erb

  <div>
    <% if Purchaser.all.count > 0 %>
---
SELECT COUNT(*) FROM `purchasers`