app/views/uploads/purge_and_reset.html.erb

SELECT COUNT(*) FROM `purchasers`
---
  <% if Purchaser.all.count == 0 %>