app/views/uploads/upload_result.html.erb

  <div class="links">
    <% if Purchaser.all.count > 0 %>
---
SELECT COUNT(*) FROM `purchasers`